Revit 2026 API

# AssemblyDifferenceNone Class

---

The two assemblies being compared are identical

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceNone

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceNone : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceNone
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceNone : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceNone =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceNone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyDifference) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AssemblyDifference) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace